blog/2020-09-02/Implementing-Method-Calls-In-x7.org
# -*- find-file-hook: make-blogging-mode -*-
#+AUTHOR: David Briggs
#+TITLE: Implementing Records in x7
#+OPTIONS: html-style:nil num:nil ^:nil
<2020-05-22 Fri>
#+ATTR_HTML: target="_blank"


* Implementing Records in x7

[[https://github.com/dpbriggs/x7][x7]] is a lisp I made to explore language design and interpreters. Here's the hello world for it:

#+begin_src lisp
(println "Hello World!")
#+end_src

It's got all the functional niceness that lisps provide:

#+begin_src clojure
  ;; Define a function which squares the input
  (defn square (x)
    (* x x))

  ;; predicate for x mod 4 == 1
  (defn is-one-mod-4 (x)
    (= 1 (% x 4)))

  ;; Filter and map the first two hundred numbers
  (filter is-one-mod-4
          (map square (range 200)))

  ;; Outputs: (1 9 25 49 81 121 169 225 ...)
#+end_src

=x7= has all the nice immutable, stateless fun that functional languages provide.
What it can't do is represent types which are internally stateful, like files or sockets.
This article will explain how we can add state to the language in the form of =Records=.

The motivation for this that the OS expects you maintain some state if you want to operate on files (or really any IO). There's tricks to avoid internally mutable state, but it's way more fun to add it to the language.

=Records=, or objects, allow us to encapsulate state in one place, that you can call methods on.
We'll work towards opening, writing, and reading from a file in =x7=. This is what it looks like:


#+begin_src clojure
  ;; Open a file
  (def my-file (fs::open "my_file.txt"))

  ;; .write is a method of the record File,
  ;; which will write strings to the file
  (.write my-file "Hello World")

  ;; Similarly, we can use the .read_to_string
  ;; method to read the file contents
  (.read_to_string my-file)
#+end_src

Before we can implement Records, we'll need a better idea of =x7='s interpreter internals.

** x7 Interpreter Internals

To run =x7= programs, we need to parse the incoming strings into a form we can actually evaluate. Central to this is the type =Expr=, which represents all possible types in the interpreter:

#+begin_src rust
  pub(crate) enum Expr {
      Num(Num),
      Symbol(Symbol),
      List(Vector<Expr>),
      Function(Function),
      // elided variants...
  }
#+end_src

The shown members of that enum are the minimum required variants to evaluate simple expressions like =(+ 1 1)=. If you're not familiar with lisps, this is the same thing as =1 + 1=.

** Parsing "(+ 1 1)"

The string ="(+ 1 1)"= needs to get transformed into a type we can operate on.
The details of the [[https://github.com/dpbriggs/x7/blob/serialization/src/parser.rs#L1][parser]] aren't relevant this article. All we really need to know is that =(+ 1 1)= gets transformed into the following =Expr= type:

#+begin_src rust
  Expr::List(
      Expr::Symbol("+"),
      Expr::Num(1),
      Expr::Num(1),
  )
#+end_src

This form is very convenient as we can recursively evaluate it to facilitate computation.

** Evaluating (+ 1 1)

Crucial to lisps is the =expression=, or the idea that types just exist and propagate through computation. Evaluation simply stated is a computation process of taking an expression, and returning another expression. For example, typing =3.3= in the =x7= interpreter returns =3.3=, another expression. In contrast, =(+ 1 1)= is considerably more complex, as it represents a function call to add two numbers. We'll need to work our way there.

To build our way to evaluating =(+ 1 1)=, we'll need to discuss core concepts like =Expressions=, =Symbols=, and =Lists=.

