blog/2020-09-02/Implementing-Method-Calls-In-x7.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-09-12 Sat 18:45 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Implementing Records in x7</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="David Briggs" />
</head>
<body>
<div id="content">
<h1 class="title">Implementing Records in x7</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org1a49bd3">Implementing Records in x7</a>
<ul>
<li><a href="#org1661d22">x7 Interpreter Internals</a></li>
<li><a href="#orgc104496">Parsing "(+ 1 1)"</a></li>
<li><a href="#orgea01f8a">Evaluating (+ 1 1)</a>
<ul>
<li><a href="#orga8895b4">Evaluating Expressions</a></li>
<li><a href="#org2c7ca01">Evaluating Symbols</a></li>
<li><a href="#orga8631d9">Evaluating Lists</a></li>
</ul>
</li>
<li><a href="#org6217256">The Record Trait</a>
<ul>
<li><a href="#org125a72c">Wiring RecordType into x7</a></li>
<li><a href="#orgd6d36e7">Adding call_method to the standard library</a></li>
<li><a href="#org2fd690a">Implementing the File Record</a></li>
</ul>
</li>
<li><a href="#org2499492">Adding Method call syntax in x7</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
<span class="timestamp-wrapper"><span class="timestamp">&lt;2020-05-22 Fri&gt;</span></span>
</p>


<div id="outline-container-org1a49bd3" class="outline-2">
<h2 id="org1a49bd3">Implementing Records in x7</h2>
<div class="outline-text-2" id="text-org1a49bd3">
<p>
<a href="https://github.com/dpbriggs/x7">x7</a> is a lisp I made to explore language design and interpreters. Here's the hello world for it:
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #DCDCCC;">(</span>println <span style="color: #D9A0A0;">"Hello World!"</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>

<p>
It's got all the functional niceness that lisps provide:
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #6C8C6C;">;; </span><span style="color: #8CAC8C;">Define a function which squares the input</span>
<span style="color: #DCDCCC;">(</span><span style="color: #FDECBC; font-weight: bold;">defn</span> <span style="color: #A0EDF0;">square</span> <span style="color: #CCF8CC;">(</span>x<span style="color: #CCF8CC;">)</span>
  <span style="color: #CCF8CC;">(</span>* x x<span style="color: #CCF8CC;">)</span><span style="color: #DCDCCC;">)</span>

<span style="color: #6C8C6C;">;; </span><span style="color: #8CAC8C;">predicate for x mod 4 == 1</span>
<span style="color: #DCDCCC;">(</span><span style="color: #FDECBC; font-weight: bold;">defn</span> <span style="color: #A0EDF0;">is-one-mod-4</span> <span style="color: #CCF8CC;">(</span>x<span style="color: #CCF8CC;">)</span>
  <span style="color: #CCF8CC;">(</span>= <span style="color: #CCF8CC;">1</span> <span style="color: #DDCC9C;">(</span><span style="color: #ECBC9C;">%</span> x <span style="color: #CCF8CC;">4</span><span style="color: #DDCC9C;">)</span><span style="color: #CCF8CC;">)</span><span style="color: #DCDCCC;">)</span>

<span style="color: #6C8C6C;">;; </span><span style="color: #8CAC8C;">Filter and map the first two hundred numbers</span>
<span style="color: #DCDCCC;">(</span>filter is-one-mod-4
        <span style="color: #CCF8CC;">(</span>map square <span style="color: #DDCC9C;">(</span>range <span style="color: #CCF8CC;">200</span><span style="color: #DDCC9C;">)</span><span style="color: #CCF8CC;">)</span><span style="color: #DCDCCC;">)</span>

<span style="color: #6C8C6C;">;; </span><span style="color: #8CAC8C;">Outputs: (1 9 25 49 81 121 169 225 ...)</span>
</pre>
</div>

<p>
<code>x7</code> has all the nice immutable, stateless fun that functional languages provide.
What it can't do is represent types which are internally stateful, like files or sockets.
This article will explain how we can add state to the language in the form of <code>Records</code>.
</p>

<p>
The motivation for this that the OS expects you maintain some state if you want to operate on files (or really any IO). There's tricks to avoid internally mutable state, but it's way more fun to add it to the language.
</p>

<p>
<code>Records</code>, or objects, allow us to encapsulate state in one place, that you can call methods on.
We'll work towards opening, writing, and reading from a file in <code>x7</code>. This is what it looks like:
</p>


<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #6C8C6C;">;; </span><span style="color: #8CAC8C;">Open a file</span>
<span style="color: #DCDCCC;">(</span><span style="color: #FDECBC; font-weight: bold;">def</span> <span style="color: #ECBC9C;">my-file</span> <span style="color: #CCF8CC;">(</span>fs<span style="color: #CCF8CC;">::open</span> <span style="color: #D9A0A0;">"my_file.txt"</span><span style="color: #CCF8CC;">)</span><span style="color: #DCDCCC;">)</span>

<span style="color: #6C8C6C;">;; </span><span style="color: #8CAC8C;">.write is a method of the record File,</span>
<span style="color: #6C8C6C;">;; </span><span style="color: #8CAC8C;">which will write strings to the file</span>
<span style="color: #DCDCCC;">(</span>.write my-file <span style="color: #D9A0A0;">"Hello World"</span><span style="color: #DCDCCC;">)</span>

<span style="color: #6C8C6C;">;; </span><span style="color: #8CAC8C;">Similarly, we can use the .read_to_string</span>
<span style="color: #6C8C6C;">;; </span><span style="color: #8CAC8C;">method to read the file contents</span>
<span style="color: #DCDCCC;">(</span>.read_to_string my-file<span style="color: #DCDCCC;">)</span>
</pre>
</div>

<p>
Before we can implement Records, we'll need a better idea of <code>x7</code>'s interpreter internals.
</p>
</div>

<div id="outline-container-org1661d22" class="outline-3">
<h3 id="org1661d22">x7 Interpreter Internals</h3>
<div class="outline-text-3" id="text-org1661d22">
<p>
To run <code>x7</code> programs, we need to parse the incoming strings into a form we can actually evaluate. Central to this is the type <code>Expr</code>, which represents all possible types in the interpreter:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #FDECBC; font-weight: bold;">pub</span><span style="color: #DCDCCC;">(</span><span style="color: #FDECBC; font-weight: bold;">crate</span><span style="color: #DCDCCC;">)</span> <span style="color: #FDECBC; font-weight: bold;">enum</span> <span style="color: #89C5C8;">Expr</span> <span style="color: #DCDCCC;">{</span>
    <span style="color: #89C5C8;">Num</span><span style="color: #CCF8CC;">(</span><span style="color: #89C5C8;">Num</span><span style="color: #CCF8CC;">)</span>,
    <span style="color: #89C5C8;">Symbol</span><span style="color: #CCF8CC;">(</span><span style="color: #89C5C8;">Symbol</span><span style="color: #CCF8CC;">)</span>,
    <span style="color: #89C5C8;">List</span><span style="color: #CCF8CC;">(</span><span style="color: #89C5C8;">Vector</span><span style="color: #DDCC9C;">&lt;</span><span style="color: #89C5C8;">Expr</span><span style="color: #DDCC9C;">&gt;</span><span style="color: #CCF8CC;">)</span>,
    <span style="color: #89C5C8;">Function</span><span style="color: #CCF8CC;">(</span><span style="color: #89C5C8;">Function</span><span style="color: #CCF8CC;">)</span>,
    <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">elided variants...</span>
<span style="color: #DCDCCC;">}</span>
</pre>
</div>

<p>
The shown members of that enum are the minimum required variants to evaluate simple expressions like <code>(+ 1 1)</code>. If you're not familiar with lisps, this is the same thing as <code>1 + 1</code>.
</p>
</div>
</div>

<div id="outline-container-orgc104496" class="outline-3">
<h3 id="orgc104496">Parsing "(+ 1 1)"</h3>
<div class="outline-text-3" id="text-orgc104496">
<p>
The string <code>"(+ 1 1)"</code> needs to get transformed into a type we can operate on.
The details of the <a href="https://github.com/dpbriggs/x7/blob/serialization/src/parser.rs#L1">parser</a> aren't relevant this article. All we really need to know is that <code>(+ 1 1)</code> gets transformed into the following <code>Expr</code> type:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #89C5C8;">Expr</span>::<span style="color: #89C5C8;">List</span><span style="color: #DCDCCC;">(</span>
    <span style="color: #89C5C8;">Expr</span>::<span style="color: #89C5C8;">Symbol</span><span style="color: #CCF8CC;">(</span><span style="color: #D9A0A0;">"+"</span><span style="color: #CCF8CC;">)</span>,
    <span style="color: #89C5C8;">Expr</span>::<span style="color: #89C5C8;">Num</span><span style="color: #CCF8CC;">(</span><span style="color: #CCF8CC;">1</span><span style="color: #CCF8CC;">)</span>,
    <span style="color: #89C5C8;">Expr</span>::<span style="color: #89C5C8;">Num</span><span style="color: #CCF8CC;">(</span><span style="color: #CCF8CC;">1</span><span style="color: #CCF8CC;">)</span>,
<span style="color: #DCDCCC;">)</span>
</pre>
</div>

<p>
This form is very convenient as we can recursively evaluate it to facilitate computation.
</p>
</div>
</div>

<div id="outline-container-orgea01f8a" class="outline-3">
<h3 id="orgea01f8a">Evaluating (+ 1 1)</h3>
<div class="outline-text-3" id="text-orgea01f8a">
<p>
Crucial to lisps is the <code>expression</code>, or the idea that types just exist and propagate through computation. Evaluation simply stated is a computation process of taking an expression, and returning another expression. For example, typing <code>3.3</code> in the <code>x7</code> interpreter returns <code>3.3</code>, another expression. In contrast, <code>(+ 1 1)</code> is considerably more complex, as it represents a function call to add two numbers. We'll need to work our way there.
</p>

<p>
To build our way to evaluating <code>(+ 1 1)</code>, we'll need to discuss core concepts like <code>Expressions</code>, <code>Symbols</code>, and <code>Lists</code>.
</p>
</div>
