blog/2020-09-02/Implementing-Method-Calls-In-x7.org
*** Evaluating Expressions

As mentioned earlier, evaluation is fundamental to the function of =x7=. More importantly, different types evaluate differently!

Here's a quick preview of what different types evaluate to:

#+CAPTION: Eval Behaviour for diffent types
#+ATTR_HTML: :border 2 :rules all :frame border :width 70%
|----------+-----------------------------------------------------------------------|
| Type     | Eval Behaviour                                                        |
|----------+-----------------------------------------------------------------------|
| Num      | Itself - another num.                                                 |
| Function | Itself - the same function.                                           |
| Symbol   | A lookup to find whatever the symbol represents (function, etc).      |
| Lists    | A function call, where the first member is interpreted as a function. |
|----------+-----------------------------------------------------------------------|

If we start the =x7= interpreter, we can see this in action:

#+begin_example
>>> 3.3                ;; Num
3.3
>>> (fn (x) (x))       ;; Function
Fn<AnonFn, 1, [ x ]>
>>> +                  ;; Symbol
Fn<+, 1, [ ]>
>>> (+ 1 1)            ;; List
2
#+end_example

With this behaviour in mind, we'll need to better understand how Symbols work in the interpreter.

*** Evaluating Symbols

Symbols act as references to something else in the interpreter - things like constants or functions. =x7= uses the =SymbolTable= type, which provides a =lookup(&self, key: &Expr)= method to map symbols to expressions in the interpreter.

The implementation of =eval= for =Symbol= looks like:

#+begin_src rust
  // self is an Expr
  if self.is_symbol() {
      return symbol_table.lookup(&self);
  }
#+end_src

Part of the =x7= initialization process is to populate the symbol table with the standard library - either from =rust= with the =make_stdlib_fns!= macro or
the =x7= files in =stdlib/=. If we disable symbol population you'll see that =x7= runs just fine, but isn't very useful:

#+begin_example
  ;; x7 without a stdlib isn't very useful
  >>> +
  Error: Unknown Symbol +
#+end_example

*** Evaluating Lists

The next area is to understand is the interaction between =Lists= and =Symbols=. A list evaluation in =x7= (and lisps) is a _function call_,
with the following convention:

#+begin_src lisp
(<fn-expr> <arg1> <arg2> ...)
#+end_src

The goal then is for the =x7= interpreter to evaluate =<fn-expr>= to a function, and then call the function with the args.
The vast majority of time =<fn-expr>= will be a symbol, like =+= or =-=, so it'll be a symbol lookup.
The process we want then:

1. Evaluate =<fn-expr>=, and hope it returns a =Function=
2. Call the =Function= with the args provided.

In =rust= this looks like:

#+begin_src rust
  if let Ok(mut list) = self.get_list() {
      // Empty lists are _not_ function calls
      if list.is_empty() {
          return Ok(self.clone());
      }

      let head = list.pop_front().unwrap();
      let tail = list;

      return head.eval(&symbol_table)?.call_fn(tail, symbol_table);
  }
#+end_src

The last line is the operative one - we evaluate the first item (=head=),
and the use the =call_fn= method to call the function.

If you're not super familiar with rust, the last line can be understood as:

1. Evaluate =head=, and early return if we get an error.
   1. The most common error is simply the symbol not resolving. More exotic errors could be something like =head= is itself a function call that failed.
   2. To elaborate further, =head= can evaluate to _anything_. While this case is intended to map symbols to functions, anything can happen here. If we didn't evaluate =head=, =Symbol("+")= would never become the function =Fn<+, 1, [ ]>=.
      1. For the curious, =((if (random_bool) + -) 10 5)= is a valid =x7= program. It randomly returns 5 or 15.
2. Call the method =call_fn=.
   1. If =head= doesn't evaluate to a function, return the error =NotAFunction=
   2. If it's a function, call it with args =tail=

Notably, we don't evaluate =tail=. To allow conditional constructs like =if= or =cond= to not evaluate branches not taken, we need a way to opt out of evaluation! This is implemented as a flag on the =Function= struct which can be controlled by the =rust= portion of the standard library.

Now that we have an overview of the =x7= interpreter internals, we can actually add records to the language!

