blog/2020-09-02/Implementing-Method-Calls-In-x7.html

<div id="outline-container-orga8895b4" class="outline-4">
<h4 id="orga8895b4">Evaluating Expressions</h4>
<div class="outline-text-4" id="text-orga8895b4">
<p>
As mentioned earlier, evaluation is fundamental to the function of <code>x7</code>. More importantly, different types evaluate differently!
</p>

<p>
Here's a quick preview of what different types evaluate to:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="all" frame="border" width="70%">
<caption class="t-above"><span class="table-number">Table 1:</span> Eval Behaviour for diffent types</caption>

<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Type</th>
<th scope="col" class="org-left">Eval Behaviour</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Num</td>
<td class="org-left">Itself - another num.</td>
</tr>

<tr>
<td class="org-left">Function</td>
<td class="org-left">Itself - the same function.</td>
</tr>

<tr>
<td class="org-left">Symbol</td>
<td class="org-left">A lookup to find whatever the symbol represents (function, etc).</td>
</tr>

<tr>
<td class="org-left">Lists</td>
<td class="org-left">A function call, where the first member is interpreted as a function.</td>
</tr>
</tbody>
</table>

<p>
If we start the <code>x7</code> interpreter, we can see this in action:
</p>

<pre class="example">
&gt;&gt;&gt; 3.3                ;; Num
3.3
&gt;&gt;&gt; (fn (x) (x))       ;; Function
Fn&lt;AnonFn, 1, [ x ]&gt;
&gt;&gt;&gt; +                  ;; Symbol
Fn&lt;+, 1, [ ]&gt;
&gt;&gt;&gt; (+ 1 1)            ;; List
2
</pre>

<p>
With this behaviour in mind, we'll need to better understand how Symbols work in the interpreter.
</p>
</div>
</div>

<div id="outline-container-org2c7ca01" class="outline-4">
<h4 id="org2c7ca01">Evaluating Symbols</h4>
<div class="outline-text-4" id="text-org2c7ca01">
<p>
Symbols act as references to something else in the interpreter - things like constants or functions. <code>x7</code> uses the <code>SymbolTable</code> type, which provides a <code>lookup(&amp;self, key: &amp;Expr)</code> method to map symbols to expressions in the interpreter.
</p>

<p>
The implementation of <code>eval</code> for <code>Symbol</code> looks like:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">self is an Expr</span>
<span style="color: #FDECBC; font-weight: bold;">if</span> <span style="color: #FDECBC; font-weight: bold;">self</span>.is_symbol<span style="color: #DCDCCC;">()</span> <span style="color: #DCDCCC;">{</span>
    <span style="color: #FDECBC; font-weight: bold;">return</span> symbol_table.lookup<span style="color: #CCF8CC;">(</span>&amp;<span style="color: #FDECBC; font-weight: bold;">self</span><span style="color: #CCF8CC;">)</span>;
<span style="color: #DCDCCC;">}</span>
</pre>
</div>

<p>
Part of the <code>x7</code> initialization process is to populate the symbol table with the standard library - either from <code>rust</code> with the <code>make_stdlib_fns!</code> macro or
the <code>x7</code> files in <code>stdlib/</code>. If we disable symbol population you'll see that <code>x7</code> runs just fine, but isn't very useful:
</p>

<pre class="example">
;; x7 without a stdlib isn't very useful
&gt;&gt;&gt; +
Error: Unknown Symbol +
</pre>
</div>
</div>

<div id="outline-container-orga8631d9" class="outline-4">
<h4 id="orga8631d9">Evaluating Lists</h4>
<div class="outline-text-4" id="text-orga8631d9">
<p>
The next area is to understand is the interaction between <code>Lists</code> and <code>Symbols</code>. A list evaluation in <code>x7</code> (and lisps) is a <span class="underline">function call</span>,
with the following convention:
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #DCDCCC;">(</span>&lt;fn-expr&gt; &lt;arg1&gt; &lt;arg2&gt; ...<span style="color: #DCDCCC;">)</span>
</pre>
</div>

<p>
The goal then is for the <code>x7</code> interpreter to evaluate <code>&lt;fn-expr&gt;</code> to a function, and then call the function with the args.
The vast majority of time <code>&lt;fn-expr&gt;</code> will be a symbol, like <code>+</code> or <code>-</code>, so it'll be a symbol lookup.
The process we want then:
</p>

<ol class="org-ol">
<li>Evaluate <code>&lt;fn-expr&gt;</code>, and hope it returns a <code>Function</code></li>
<li>Call the <code>Function</code> with the args provided.</li>
</ol>

<p>
In <code>rust</code> this looks like:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #FDECBC; font-weight: bold;">if</span> <span style="color: #FDECBC; font-weight: bold;">let</span> <span style="color: #89C5C8;">Ok</span><span style="color: #DCDCCC;">(</span><span style="color: #FDECBC; font-weight: bold;">mut</span> list<span style="color: #DCDCCC;">)</span> = <span style="color: #FDECBC; font-weight: bold;">self</span>.get_list<span style="color: #DCDCCC;">()</span> <span style="color: #DCDCCC;">{</span>
    <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">Empty lists are _not_ function calls</span>
    <span style="color: #FDECBC; font-weight: bold;">if</span> list.is_empty<span style="color: #CCF8CC;">()</span> <span style="color: #CCF8CC;">{</span>
        <span style="color: #FDECBC; font-weight: bold;">return</span> <span style="color: #89C5C8;">Ok</span><span style="color: #DDCC9C;">(</span><span style="color: #FDECBC; font-weight: bold;">self</span>.clone<span style="color: #A0EDF0;">()</span><span style="color: #DDCC9C;">)</span>;
    <span style="color: #CCF8CC;">}</span>

    <span style="color: #FDECBC; font-weight: bold;">let</span> <span style="color: #ECBC9C;">head</span> = list.pop_front<span style="color: #CCF8CC;">()</span>.unwrap<span style="color: #CCF8CC;">()</span>;
    <span style="color: #FDECBC; font-weight: bold;">let</span> <span style="color: #ECBC9C;">tail</span> = list;

    <span style="color: #FDECBC; font-weight: bold;">return</span> head.eval<span style="color: #CCF8CC;">(</span>&amp;symbol_table<span style="color: #CCF8CC;">)</span><span style="color: #DCDCCC; font-weight: bold;">?</span>.call_fn<span style="color: #CCF8CC;">(</span>tail, symbol_table<span style="color: #CCF8CC;">)</span>;
<span style="color: #DCDCCC;">}</span>
</pre>
</div>

<p>
The last line is the operative one - we evaluate the first item (<code>head</code>),
and the use the <code>call_fn</code> method to call the function.
</p>

<p>
If you're not super familiar with rust, the last line can be understood as:
</p>

<ol class="org-ol">
<li>Evaluate <code>head</code>, and early return if we get an error.
<ol class="org-ol">
<li>The most common error is simply the symbol not resolving. More exotic errors could be something like <code>head</code> is itself a function call that failed.</li>
<li>To elaborate further, <code>head</code> can evaluate to <span class="underline">anything</span>. While this case is intended to map symbols to functions, anything can happen here. If we didn't evaluate <code>head</code>, <code>Symbol("+")</code> would never become the function <code>Fn&lt;+, 1, [ ]&gt;</code>.
<ol class="org-ol">
<li>For the curious, <code>((if (random_bool) + -) 10 5)</code> is a valid <code>x7</code> program. It randomly returns 5 or 15.</li>
</ol></li>
</ol></li>
<li>Call the method <code>call_fn</code>.
<ol class="org-ol">
<li>If <code>head</code> doesn't evaluate to a function, return the error <code>NotAFunction</code></li>
<li>If it's a function, call it with args <code>tail</code></li>
</ol></li>
</ol>

<p>
Notably, we don't evaluate <code>tail</code>. To allow conditional constructs like <code>if</code> or <code>cond</code> to not evaluate branches not taken, we need a way to opt out of evaluation! This is implemented as a flag on the <code>Function</code> struct which can be controlled by the <code>rust</code> portion of the standard library.
</p>

<p>
Now that we have an overview of the <code>x7</code> interpreter internals, we can actually add records to the language!
</p>
</div>
</div>
</div>
