blog/2020-09-02/Implementing-Method-Calls-In-x7.org
** The Record Trait

To represent types which are internally stateful, we'll add a trait called =Record= to the language. It needs to express following behaviours:

1. Call methods with arguments.
2. Represent the type in a display and debug way.
3. Represent the type name as a string, and it's methods.
4. Uniquely identify the type (hash).
5. Clone the type safely.

Aside from calling methods, most of these items are related to making sure
error messages are nice, or slotting it in cleanly with the rest of the interpreter machinery.

Here's the trait in =rust=:

#+begin_src rust
  /// Fundamental trait for records.
  ///
  /// Records allow x7 to represent a variety of internally mutable types
  /// while not expanding the Expr enum too much. These types are responsible for
  /// implementing RecordDoc if they want to have documentation.
  pub(crate) trait Record: Sync + Send {
      /// Call a method on this record.
      /// (.method_name <rec> arg1 arg2 arg3)
      /// Becomes:
      /// (&self: <rec>, sym: "method_name", args: vector![arg1, arg2, arg3])
      fn call_method(&self, sym: &str, args: Vector<Expr>) -> LispResult<Expr>;

      /// Uniquely identify this record
      fn id(&self) -> u64 {
          0
      }
      /// Nicely display the record type.
      fn display(&self) -> String;

      /// Add more information for debug printing
      fn debug(&self) -> String;

      /// Clone the object.
      fn clone(&self) -> RecordType;

      /// Return the names of the methods for help messages.
      fn methods(&self) -> Vec<&'static str>;

      /// Return the type name for nice help messages
      fn type_name(&self) -> &'static str;
  }
#+end_src

Now that we have a trait, we need a fundamental type we can export and use throughout
=x7=. Since we want to use trait objects, a =Box= is a natural choice:

#+begin_src rust
pub(crate) type RecordType = Box<dyn Record>;
#+end_src

I'll elide the implementation details to get =Record= implemented for =RecordType=,
but if you're curious, they can be found [[https://github.com/dpbriggs/x7/blob/master/src/records/record.rs#L48][here]].


