blog/2020-09-02/Implementing-Method-Calls-In-x7.html

<div id="outline-container-org6217256" class="outline-3">
<h3 id="org6217256">The Record Trait</h3>
<div class="outline-text-3" id="text-org6217256">
<p>
To represent types which are internally stateful, we'll add a trait called <code>Record</code> to the language. It needs to express following behaviours:
</p>

<ol class="org-ol">
<li>Call methods with arguments.</li>
<li>Represent the type in a display and debug way.</li>
<li>Represent the type name as a string, and it's methods.</li>
<li>Uniquely identify the type (hash).</li>
<li>Clone the type safely.</li>
</ol>

<p>
Aside from calling methods, most of these items are related to making sure
error messages are nice, or slotting it in cleanly with the rest of the interpreter machinery.
</p>

<p>
Here's the trait in <code>rust</code>:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #ACD2AC;">/// Fundamental trait for records.</span>
<span style="color: #ACD2AC;">///</span>
<span style="color: #ACD2AC;">/// Records allow x7 to represent a variety of internally mutable types</span>
<span style="color: #ACD2AC;">/// while not expanding the Expr enum too much. These types are responsible for</span>
<span style="color: #ACD2AC;">/// implementing RecordDoc if they want to have documentation.</span>
<span style="color: #FDECBC; font-weight: bold;">pub</span><span style="color: #DCDCCC;">(</span><span style="color: #FDECBC; font-weight: bold;">crate</span><span style="color: #DCDCCC;">)</span> <span style="color: #FDECBC; font-weight: bold;">trait</span> <span style="color: #ECBC9C;">Record</span>: <span style="color: #89C5C8;">Sync</span> + <span style="color: #89C5C8;">Send</span> <span style="color: #DCDCCC;">{</span>
    <span style="color: #ACD2AC;">/// Call a method on this record.</span>
    <span style="color: #ACD2AC;">/// (.method_name &lt;rec&gt; arg1 arg2 arg3)</span>
    <span style="color: #ACD2AC;">/// Becomes:</span>
    <span style="color: #ACD2AC;">/// (&amp;self: &lt;rec&gt;, sym: "method_name", args: vector![arg1, arg2, arg3])</span>
    <span style="color: #FDECBC; font-weight: bold;">fn</span> <span style="color: #A0EDF0;">call_method</span><span style="color: #CCF8CC;">(</span>&amp;<span style="color: #FDECBC; font-weight: bold;">self</span>, <span style="color: #ECBC9C;">sym</span>: &amp;<span style="color: #89C5C8;">str</span>, <span style="color: #ECBC9C;">args</span>: <span style="color: #89C5C8;">Vector</span><span style="color: #DDCC9C;">&lt;</span><span style="color: #89C5C8;">Expr</span><span style="color: #DDCC9C;">&gt;</span><span style="color: #CCF8CC;">)</span> -&gt; <span style="color: #89C5C8;">LispResult</span><span style="color: #CCF8CC;">&lt;</span><span style="color: #89C5C8;">Expr</span><span style="color: #CCF8CC;">&gt;</span>;

    <span style="color: #ACD2AC;">/// Uniquely identify this record</span>
    <span style="color: #FDECBC; font-weight: bold;">fn</span> <span style="color: #A0EDF0;">id</span><span style="color: #CCF8CC;">(</span>&amp;<span style="color: #FDECBC; font-weight: bold;">self</span><span style="color: #CCF8CC;">)</span> -&gt; <span style="color: #89C5C8;">u64</span> <span style="color: #CCF8CC;">{</span>
        <span style="color: #CCF8CC;">0</span>
    <span style="color: #CCF8CC;">}</span>
    <span style="color: #ACD2AC;">/// Nicely display the record type.</span>
    <span style="color: #FDECBC; font-weight: bold;">fn</span> <span style="color: #A0EDF0;">display</span><span style="color: #CCF8CC;">(</span>&amp;<span style="color: #FDECBC; font-weight: bold;">self</span><span style="color: #CCF8CC;">)</span> -&gt; <span style="color: #89C5C8;">String</span>;

    <span style="color: #ACD2AC;">/// Add more information for debug printing</span>
    <span style="color: #FDECBC; font-weight: bold;">fn</span> <span style="color: #A0EDF0;">debug</span><span style="color: #CCF8CC;">(</span>&amp;<span style="color: #FDECBC; font-weight: bold;">self</span><span style="color: #CCF8CC;">)</span> -&gt; <span style="color: #89C5C8;">String</span>;

    <span style="color: #ACD2AC;">/// Clone the object.</span>
    <span style="color: #FDECBC; font-weight: bold;">fn</span> <span style="color: #A0EDF0;">clone</span><span style="color: #CCF8CC;">(</span>&amp;<span style="color: #FDECBC; font-weight: bold;">self</span><span style="color: #CCF8CC;">)</span> -&gt; <span style="color: #89C5C8;">RecordType</span>;

    <span style="color: #ACD2AC;">/// Return the names of the methods for help messages.</span>
    <span style="color: #FDECBC; font-weight: bold;">fn</span> <span style="color: #A0EDF0;">methods</span><span style="color: #CCF8CC;">(</span>&amp;<span style="color: #FDECBC; font-weight: bold;">self</span><span style="color: #CCF8CC;">)</span> -&gt; <span style="color: #89C5C8;">Vec</span><span style="color: #CCF8CC;">&lt;</span>&amp;'<span style="color: #FDECBC; font-weight: bold;">static</span> <span style="color: #89C5C8;">str</span><span style="color: #CCF8CC;">&gt;</span>;

    <span style="color: #ACD2AC;">/// Return the type name for nice help messages</span>
    <span style="color: #FDECBC; font-weight: bold;">fn</span> <span style="color: #A0EDF0;">type_name</span><span style="color: #CCF8CC;">(</span>&amp;<span style="color: #FDECBC; font-weight: bold;">self</span><span style="color: #CCF8CC;">)</span> -&gt; &amp;'<span style="color: #FDECBC; font-weight: bold;">static</span> <span style="color: #89C5C8;">str</span>;
<span style="color: #DCDCCC;">}</span>
</pre>
</div>

<p>
Now that we have a trait, we need a fundamental type we can export and use throughout
<code>x7</code>. Since we want to use trait objects, a <code>Box</code> is a natural choice:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #FDECBC; font-weight: bold;">pub</span><span style="color: #DCDCCC;">(</span><span style="color: #FDECBC; font-weight: bold;">crate</span><span style="color: #DCDCCC;">)</span> <span style="color: #FDECBC; font-weight: bold;">type</span> <span style="color: #89C5C8;">RecordType</span> = <span style="color: #89C5C8;">Box</span><span style="color: #DCDCCC;">&lt;</span><span style="color: #FDECBC; font-weight: bold;">dyn</span> <span style="color: #89C5C8;">Record</span><span style="color: #DCDCCC;">&gt;</span>;
</pre>
</div>

<p>
I'll elide the implementation details to get <code>Record</code> implemented for <code>RecordType</code>,
but if you're curious, they can be found <a href="https://github.com/dpbriggs/x7/blob/master/src/records/record.rs#L48">here</a>.
</p>
</div>
