blog/2020-09-02/Implementing-Method-Calls-In-x7.org
*** Wiring RecordType into x7

To integrate =RecordType= into the language, we'll need to add it to aforementioned
=Expr= enum. Here's what it looked like before we add =Record=:

#+begin_src rust
  #[derive(Clone, Hash)]
  pub(crate) enum Expr {
      Num(Num),
      Symbol(Symbol),
      String(String),
      // truncated...
  }
#+end_src

And after:

#+begin_src rust
  #[derive(Clone, Hash)]
  pub(crate) enum Expr {
      Num(Num),
      Symbol(Symbol),
      String(String),
      Record(crate::records::RecordType),
      // truncated...
  }
#+end_src

It's just that easy. We can use compiler errors to figure out what we're missing.

The compiler errors tells us that we're missing =Hash=, =PartialEq=, and =Clone= on =RecordType=:

#+begin_src rust
  /// We can stick whatever we want into hashmaps, so we need Hash implemented
  impl Hash for RecordType {
      fn hash<H: Hasher>(&self, state: &mut H) {
          self.id().hash(state);
      }
  }

  /// We also need to equality check RecordTypes
  /// As their internal state may differ, always return false.
  /// This could be improved.
  impl PartialEq for RecordType {
      fn eq(&self, _other: &RecordType) -> bool {
          false
      }
  }

  /// x7 clones types all over the place
  impl Clone for RecordType {
      fn clone(&self) -> RecordType {
          Record::clone(self)
      }
  }
#+end_src

Great! We now have the requisite traits implemented for =RecordType=, and
aside from a few changes like my custom =Display= implementation, we're good to go.

The last thing we'll want is a way to grab a =RecordType= out of the enum when we want it:

#+begin_src rust
impl Expr {
  // ... elided...
  pub(crate) fn get_record(&self) -> LispResult<RecordType> {
      if let Expr::Record(r) = self {
          Ok(r.clone())
      } else {
          bad_types!("record", &self)
      }
  }
}
#+end_src

This will let us grab a record type in our standard library and have nice error messages
if we don't.

The next thing we'll want to do is add a standard library function to call methods!

