blog/2020-09-02/Implementing-Method-Calls-In-x7.html


<div id="outline-container-org125a72c" class="outline-4">
<h4 id="org125a72c">Wiring RecordType into x7</h4>
<div class="outline-text-4" id="text-org125a72c">
<p>
To integrate <code>RecordType</code> into the language, we'll need to add it to aforementioned
<code>Expr</code> enum. Here's what it looked like before we add <code>Record</code>:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #9CC7FB;">#</span><span style="color: #DCDCCC;">[</span><span style="color: #9CC7FB;">derive</span><span style="color: #CCF8CC;">(</span><span style="color: #9CC7FB;">Clone, Hash</span><span style="color: #CCF8CC;">)</span><span style="color: #DCDCCC;">]</span>
<span style="color: #FDECBC; font-weight: bold;">pub</span><span style="color: #DCDCCC;">(</span><span style="color: #FDECBC; font-weight: bold;">crate</span><span style="color: #DCDCCC;">)</span> <span style="color: #FDECBC; font-weight: bold;">enum</span> <span style="color: #89C5C8;">Expr</span> <span style="color: #DCDCCC;">{</span>
    <span style="color: #89C5C8;">Num</span><span style="color: #CCF8CC;">(</span><span style="color: #89C5C8;">Num</span><span style="color: #CCF8CC;">)</span>,
    <span style="color: #89C5C8;">Symbol</span><span style="color: #CCF8CC;">(</span><span style="color: #89C5C8;">Symbol</span><span style="color: #CCF8CC;">)</span>,
    <span style="color: #89C5C8;">String</span><span style="color: #CCF8CC;">(</span><span style="color: #89C5C8;">String</span><span style="color: #CCF8CC;">)</span>,
    <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">truncated...</span>
<span style="color: #DCDCCC;">}</span>
</pre>
</div>

<p>
And after:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #9CC7FB;">#</span><span style="color: #DCDCCC;">[</span><span style="color: #9CC7FB;">derive</span><span style="color: #CCF8CC;">(</span><span style="color: #9CC7FB;">Clone, Hash</span><span style="color: #CCF8CC;">)</span><span style="color: #DCDCCC;">]</span>
<span style="color: #FDECBC; font-weight: bold;">pub</span><span style="color: #DCDCCC;">(</span><span style="color: #FDECBC; font-weight: bold;">crate</span><span style="color: #DCDCCC;">)</span> <span style="color: #FDECBC; font-weight: bold;">enum</span> <span style="color: #89C5C8;">Expr</span> <span style="color: #DCDCCC;">{</span>
    <span style="color: #89C5C8;">Num</span><span style="color: #CCF8CC;">(</span><span style="color: #89C5C8;">Num</span><span style="color: #CCF8CC;">)</span>,
    <span style="color: #89C5C8;">Symbol</span><span style="color: #CCF8CC;">(</span><span style="color: #89C5C8;">Symbol</span><span style="color: #CCF8CC;">)</span>,
    <span style="color: #89C5C8;">String</span><span style="color: #CCF8CC;">(</span><span style="color: #89C5C8;">String</span><span style="color: #CCF8CC;">)</span>,
    <span style="color: #89C5C8;">Record</span><span style="color: #CCF8CC;">(</span><span style="color: #FDECBC; font-weight: bold;">crate</span>::<span style="color: #CCF8CC;">records</span>::<span style="color: #89C5C8;">RecordType</span><span style="color: #CCF8CC;">)</span>,
    <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">truncated...</span>
<span style="color: #DCDCCC;">}</span>
</pre>
</div>

<p>
It's just that easy. We can use compiler errors to figure out what we're missing.
</p>

<p>
The compiler errors tells us that we're missing <code>Hash</code>, <code>PartialEq</code>, and <code>Clone</code> on <code>RecordType</code>:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #ACD2AC;">/// We can stick whatever we want into hashmaps, so we need Hash implemented</span>
<span style="color: #FDECBC; font-weight: bold;">impl</span> <span style="color: #89C5C8;">Hash</span> <span style="color: #FDECBC; font-weight: bold;">for</span> <span style="color: #89C5C8;">RecordType</span> <span style="color: #DCDCCC;">{</span>
    <span style="color: #FDECBC; font-weight: bold;">fn</span> <span style="color: #A0EDF0;">hash</span><span style="color: #CCF8CC;">&lt;</span><span style="color: #ECBC9C;">H</span>: <span style="color: #89C5C8;">Hasher</span><span style="color: #CCF8CC;">&gt;(</span>&amp;<span style="color: #FDECBC; font-weight: bold;">self</span>, <span style="color: #ECBC9C;">state</span>: &amp;<span style="color: #FDECBC; font-weight: bold;">mut</span> <span style="color: #89C5C8;">H</span><span style="color: #CCF8CC;">)</span> <span style="color: #CCF8CC;">{</span>
        <span style="color: #FDECBC; font-weight: bold;">self</span>.id<span style="color: #DDCC9C;">()</span>.hash<span style="color: #DDCC9C;">(</span>state<span style="color: #DDCC9C;">)</span>;
    <span style="color: #CCF8CC;">}</span>
<span style="color: #DCDCCC;">}</span>

<span style="color: #ACD2AC;">/// We also need to equality check RecordTypes</span>
<span style="color: #ACD2AC;">/// As their internal state may differ, always return false.</span>
<span style="color: #ACD2AC;">/// This could be improved.</span>
<span style="color: #FDECBC; font-weight: bold;">impl</span> <span style="color: #89C5C8;">PartialEq</span> <span style="color: #FDECBC; font-weight: bold;">for</span> <span style="color: #89C5C8;">RecordType</span> <span style="color: #DCDCCC;">{</span>
    <span style="color: #FDECBC; font-weight: bold;">fn</span> <span style="color: #A0EDF0;">eq</span><span style="color: #CCF8CC;">(</span>&amp;<span style="color: #FDECBC; font-weight: bold;">self</span>, <span style="color: #ECBC9C;">_other</span>: &amp;<span style="color: #89C5C8;">RecordType</span><span style="color: #CCF8CC;">)</span> -&gt; <span style="color: #89C5C8;">bool</span> <span style="color: #CCF8CC;">{</span>
        <span style="color: #FDECBC; font-weight: bold;">false</span>
    <span style="color: #CCF8CC;">}</span>
<span style="color: #DCDCCC;">}</span>

<span style="color: #ACD2AC;">/// x7 clones types all over the place</span>
<span style="color: #FDECBC; font-weight: bold;">impl</span> <span style="color: #89C5C8;">Clone</span> <span style="color: #FDECBC; font-weight: bold;">for</span> <span style="color: #89C5C8;">RecordType</span> <span style="color: #DCDCCC;">{</span>
    <span style="color: #FDECBC; font-weight: bold;">fn</span> <span style="color: #A0EDF0;">clone</span><span style="color: #CCF8CC;">(</span>&amp;<span style="color: #FDECBC; font-weight: bold;">self</span><span style="color: #CCF8CC;">)</span> -&gt; <span style="color: #89C5C8;">RecordType</span> <span style="color: #CCF8CC;">{</span>
        <span style="color: #89C5C8;">Record</span>::clone<span style="color: #DDCC9C;">(</span><span style="color: #FDECBC; font-weight: bold;">self</span><span style="color: #DDCC9C;">)</span>
    <span style="color: #CCF8CC;">}</span>
<span style="color: #DCDCCC;">}</span>
</pre>
</div>

<p>
Great! We now have the requisite traits implemented for <code>RecordType</code>, and
aside from a few changes like my custom <code>Display</code> implementation, we're good to go.
</p>

<p>
The last thing we'll want is a way to grab a <code>RecordType</code> out of the enum when we want it:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #FDECBC; font-weight: bold;">impl</span> <span style="color: #89C5C8;">Expr</span> <span style="color: #DCDCCC;">{</span>
  <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">... elided...</span>
  <span style="color: #FDECBC; font-weight: bold;">pub</span><span style="color: #CCF8CC;">(</span><span style="color: #FDECBC; font-weight: bold;">crate</span><span style="color: #CCF8CC;">)</span> <span style="color: #FDECBC; font-weight: bold;">fn</span> <span style="color: #A0EDF0;">get_record</span><span style="color: #CCF8CC;">(</span>&amp;<span style="color: #FDECBC; font-weight: bold;">self</span><span style="color: #CCF8CC;">)</span> -&gt; <span style="color: #89C5C8;">LispResult</span><span style="color: #CCF8CC;">&lt;</span><span style="color: #89C5C8;">RecordType</span><span style="color: #CCF8CC;">&gt;</span> <span style="color: #CCF8CC;">{</span>
      <span style="color: #FDECBC; font-weight: bold;">if</span> <span style="color: #FDECBC; font-weight: bold;">let</span> <span style="color: #89C5C8;">Expr</span>::<span style="color: #89C5C8;">Record</span><span style="color: #DDCC9C;">(</span>r<span style="color: #DDCC9C;">)</span> = <span style="color: #FDECBC; font-weight: bold;">self</span> <span style="color: #DDCC9C;">{</span>
          <span style="color: #89C5C8;">Ok</span><span style="color: #A0EDF0;">(</span>r.clone<span style="color: #ACD2AC;">()</span><span style="color: #A0EDF0;">)</span>
      <span style="color: #DDCC9C;">}</span> <span style="color: #FDECBC; font-weight: bold;">else</span> <span style="color: #DDCC9C;">{</span>
          <span style="color: #9CC7FB;">bad_types!</span><span style="color: #A0EDF0;">(</span><span style="color: #D9A0A0;">"record"</span>, &amp;<span style="color: #FDECBC; font-weight: bold;">self</span><span style="color: #A0EDF0;">)</span>
      <span style="color: #DDCC9C;">}</span>
  <span style="color: #CCF8CC;">}</span>
<span style="color: #DCDCCC;">}</span>
</pre>
</div>

<p>
This will let us grab a record type in our standard library and have nice error messages
if we don't.
</p>

<p>
The next thing we'll want to do is add a standard library function to call methods!
</p>
</div>
</div>
