blog/2020-09-02/Implementing-Method-Calls-In-x7.org
*** Adding call_method to the standard library

Now that =RecordType= is embedded in the interpreter's machinery, we can actually use it!
We will want a way to explicitly call methods in the standard library, =stdlib::call_method=.

We won't have the =.method-call= syntactic sugar yet, so a free standing =x7= function
will have to do.

Recall the signature of =Record::call_method=:

#+begin_src rust
fn call_method(&self, sym: &str, args: Vector<Expr>) -> LispResult<Expr>;
#+end_src

We'll want a standard library method that takes:

1. A record
2. A method on that record
3. Some args for that method.

Thankfully this is pretty straightforward. All functions in =x7= must have the following type:

#+begin_src rust
pub(crate) type X7FunctionPtr =
    Arc<dyn Fn(Vector<Expr>, &SymbolTable) -> LispResult<Expr> + Sync + Send>;
#+end_src

In =rust=, this looks like:

#+begin_src rust
  fn call_method(exprs: Vector<Expr>, _symbol_table: &SymbolTable) -> LispResult<Expr> {
     // TODO: Implement the function
  }
#+end_src

The next issue to tackle is the argument layout for =stdlib::call_method=.

We're only given a list of arguments, so we'll need to define a calling convention:

#+begin_src lisp
(call_method <record> <method-name> <args>...)
#+end_src

So we'll expect a record as the first member, and then the method name, and finally the args.
For example, here's how we'd expect writing to a file to look like:

#+begin_src lisp
(call_method my-file "write" "hello world")
#+end_src

Thanks to the =Expr::get_record= function we made earlier, we can easily implement =stdlib::call_method=:

#+begin_src rust
  fn call_method(exprs: Vector<Expr>, _symbol_table: &SymbolTable) -> LispResult<Expr> {
      // First list member is a record.
      let rec = exprs[0].get_record()?;

      // Second list member is the method string.
      let method = &exprs[1].get_string()?;

      // Collect the args in the list.
      let args = exprs.clone().slice(2..); // .clone() is O(1) and .slice needs a &mut

      // Finally, call the method on the record with args
      use crate::records::Record;
      rec.call_method(method, args)
  }
#+end_src

Now that we have the function, we'll need to make it accessible from the interpreter.
=x7= uses a macro called =make_stdlib_fns= to expose rust functions to the interpreter, so we need to just slot it in:

#+begin_src rust
  make_stdlib_fns!{
    // elided functions...
    ("call_method", 2, call_method, true, "<doc-string>"),
  }
#+end_src

This can be read as:

1. Expose =stdlib::call_method= to the interpreter with the symbol =call_method=, and
2. It expects at least two arguments, and
3. Ask the interpreter to evaluate the arguments (=true=), and finally
4. Have the docstring ="<doc-string>"=.

We can start the interpreter and ask it to evaluate the symbol =call_method=:

#+begin_src lisp
>>> call_method
Fn<call_method, 2, [ ]>
#+end_src

Nice! We can't really do much with it as we haven't actually implemented =Record= on any types yet, so let's do that!

