blog/2020-09-02/Implementing-Method-Calls-In-x7.html

<div id="outline-container-orgd6d36e7" class="outline-4">
<h4 id="orgd6d36e7">Adding call_method to the standard library</h4>
<div class="outline-text-4" id="text-orgd6d36e7">
<p>
Now that <code>RecordType</code> is embedded in the interpreter's machinery, we can actually use it!
We will want a way to explicitly call methods in the standard library, <code>stdlib::call_method</code>.
</p>

<p>
We won't have the <code>.method-call</code> syntactic sugar yet, so a free standing <code>x7</code> function
will have to do.
</p>

<p>
Recall the signature of <code>Record::call_method</code>:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #FDECBC; font-weight: bold;">fn</span> <span style="color: #A0EDF0;">call_method</span><span style="color: #DCDCCC;">(</span>&amp;<span style="color: #FDECBC; font-weight: bold;">self</span>, <span style="color: #ECBC9C;">sym</span>: &amp;<span style="color: #89C5C8;">str</span>, <span style="color: #ECBC9C;">args</span>: <span style="color: #89C5C8;">Vector</span><span style="color: #CCF8CC;">&lt;</span><span style="color: #89C5C8;">Expr</span><span style="color: #CCF8CC;">&gt;</span><span style="color: #DCDCCC;">)</span> -&gt; <span style="color: #89C5C8;">LispResult</span><span style="color: #DCDCCC;">&lt;</span><span style="color: #89C5C8;">Expr</span><span style="color: #DCDCCC;">&gt;</span>;
</pre>
</div>

<p>
We'll want a standard library method that takes:
</p>

<ol class="org-ol">
<li>A record</li>
<li>A method on that record</li>
<li>Some args for that method.</li>
</ol>

<p>
Thankfully this is pretty straightforward. All functions in <code>x7</code> must have the following type:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #FDECBC; font-weight: bold;">pub</span><span style="color: #DCDCCC;">(</span><span style="color: #FDECBC; font-weight: bold;">crate</span><span style="color: #DCDCCC;">)</span> <span style="color: #FDECBC; font-weight: bold;">type</span> <span style="color: #89C5C8;">X7FunctionPtr</span> =
    <span style="color: #89C5C8;">Arc</span><span style="color: #DCDCCC;">&lt;</span><span style="color: #FDECBC; font-weight: bold;">dyn</span> <span style="color: #89C5C8;">Fn</span><span style="color: #CCF8CC;">(</span><span style="color: #89C5C8;">Vector</span><span style="color: #DDCC9C;">&lt;</span><span style="color: #89C5C8;">Expr</span><span style="color: #DDCC9C;">&gt;</span>, &amp;<span style="color: #89C5C8;">SymbolTable</span><span style="color: #CCF8CC;">)</span> -&gt; <span style="color: #89C5C8;">LispResult</span><span style="color: #CCF8CC;">&lt;</span><span style="color: #89C5C8;">Expr</span><span style="color: #CCF8CC;">&gt;</span> + <span style="color: #89C5C8;">Sync</span> + <span style="color: #89C5C8;">Send</span><span style="color: #DCDCCC;">&gt;</span>;
</pre>
</div>

<p>
In <code>rust</code>, this looks like:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #FDECBC; font-weight: bold;">fn</span> <span style="color: #A0EDF0;">call_method</span><span style="color: #DCDCCC;">(</span><span style="color: #ECBC9C;">exprs</span>: <span style="color: #89C5C8;">Vector</span><span style="color: #CCF8CC;">&lt;</span><span style="color: #89C5C8;">Expr</span><span style="color: #CCF8CC;">&gt;</span>, <span style="color: #ECBC9C;">_symbol_table</span>: &amp;<span style="color: #89C5C8;">SymbolTable</span><span style="color: #DCDCCC;">)</span> -&gt; <span style="color: #89C5C8;">LispResult</span><span style="color: #DCDCCC;">&lt;</span><span style="color: #89C5C8;">Expr</span><span style="color: #DCDCCC;">&gt;</span> <span style="color: #DCDCCC;">{</span>
   <span style="color: #6C8C6C;">// </span><span style="color: #cc9393;">TODO</span><span style="color: #8CAC8C;">: Implement the function</span>
<span style="color: #DCDCCC;">}</span>
</pre>
</div>

<p>
The next issue to tackle is the argument layout for <code>stdlib::call_method</code>.
</p>

<p>
We're only given a list of arguments, so we'll need to define a calling convention:
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #DCDCCC;">(</span>call_method &lt;record&gt; &lt;method-name&gt; &lt;args&gt;...<span style="color: #DCDCCC;">)</span>
</pre>
</div>

<p>
So we'll expect a record as the first member, and then the method name, and finally the args.
For example, here's how we'd expect writing to a file to look like:
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #DCDCCC;">(</span>call_method my-file <span style="color: #D9A0A0;">"write"</span> <span style="color: #D9A0A0;">"hello world"</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>

<p>
Thanks to the <code>Expr::get_record</code> function we made earlier, we can easily implement <code>stdlib::call_method</code>:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #FDECBC; font-weight: bold;">fn</span> <span style="color: #A0EDF0;">call_method</span><span style="color: #DCDCCC;">(</span><span style="color: #ECBC9C;">exprs</span>: <span style="color: #89C5C8;">Vector</span><span style="color: #CCF8CC;">&lt;</span><span style="color: #89C5C8;">Expr</span><span style="color: #CCF8CC;">&gt;</span>, <span style="color: #ECBC9C;">_symbol_table</span>: &amp;<span style="color: #89C5C8;">SymbolTable</span><span style="color: #DCDCCC;">)</span> -&gt; <span style="color: #89C5C8;">LispResult</span><span style="color: #DCDCCC;">&lt;</span><span style="color: #89C5C8;">Expr</span><span style="color: #DCDCCC;">&gt;</span> <span style="color: #DCDCCC;">{</span>
    <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">First list member is a record.</span>
    <span style="color: #FDECBC; font-weight: bold;">let</span> <span style="color: #ECBC9C;">rec</span> = exprs<span style="color: #CCF8CC;">[</span><span style="color: #CCF8CC;">0</span><span style="color: #CCF8CC;">]</span>.get_record<span style="color: #CCF8CC;">()</span><span style="color: #DCDCCC; font-weight: bold;">?</span>;

    <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">Second list member is the method string.</span>
    <span style="color: #FDECBC; font-weight: bold;">let</span> <span style="color: #ECBC9C;">method</span> = &amp;exprs<span style="color: #CCF8CC;">[</span><span style="color: #CCF8CC;">1</span><span style="color: #CCF8CC;">]</span>.get_string<span style="color: #CCF8CC;">()</span><span style="color: #DCDCCC; font-weight: bold;">?</span>;

    <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">Collect the args in the list.</span>
    <span style="color: #FDECBC; font-weight: bold;">let</span> <span style="color: #ECBC9C;">args</span> = exprs.clone<span style="color: #CCF8CC;">()</span>.slice<span style="color: #CCF8CC;">(</span><span style="color: #CCF8CC;">2</span>..<span style="color: #CCF8CC;">)</span>; <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">.clone() is O(1) and .slice needs a &amp;mut</span>

    <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">Finally, call the method on the record with args</span>
    <span style="color: #FDECBC; font-weight: bold;">use</span> <span style="color: #FDECBC; font-weight: bold;">crate</span>::<span style="color: #CCF8CC;">records</span>::<span style="color: #89C5C8;">Record</span>;
    rec.call_method<span style="color: #CCF8CC;">(</span>method, args<span style="color: #CCF8CC;">)</span>
<span style="color: #DCDCCC;">}</span>
</pre>
</div>

<p>
Now that we have the function, we'll need to make it accessible from the interpreter.
<code>x7</code> uses a macro called <code>make_stdlib_fns</code> to expose rust functions to the interpreter, so we need to just slot it in:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #9CC7FB;">make_stdlib_fns!</span><span style="color: #DCDCCC;">{</span>
  <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">elided functions...</span>
  <span style="color: #CCF8CC;">(</span><span style="color: #D9A0A0;">"call_method"</span>, <span style="color: #CCF8CC;">2</span>, call_method, <span style="color: #FDECBC; font-weight: bold;">true</span>, <span style="color: #D9A0A0;">"&lt;doc-string&gt;"</span><span style="color: #CCF8CC;">)</span>,
<span style="color: #DCDCCC;">}</span>
</pre>
</div>

<p>
This can be read as:
</p>

<ol class="org-ol">
<li>Expose <code>stdlib::call_method</code> to the interpreter with the symbol <code>call_method</code>, and</li>
<li>It expects at least two arguments, and</li>
<li>Ask the interpreter to evaluate the arguments (<code>true</code>), and finally</li>
<li>Have the docstring <code>"&lt;doc-string&gt;"</code>.</li>
</ol>

<p>
We can start the interpreter and ask it to evaluate the symbol <code>call_method</code>:
</p>

<div class="org-src-container">
<pre class="src src-lisp">&gt;&gt;&gt; call_method
Fn&lt;call_method, <span style="color: #CCF8CC;">2</span>, [ ]&gt;
</pre>
</div>

<p>
Nice! We can't really do much with it as we haven't actually implemented <code>Record</code> on any types yet, so let's do that!
</p>
</div>
</div>
