blog/2020-09-02/Implementing-Method-Calls-In-x7.html

<div id="outline-container-org2fd690a" class="outline-4">
<h4 id="org2fd690a">Implementing the File Record</h4>
<div class="outline-text-4" id="text-org2fd690a">
<p>
The original motivation for adding <code>Record</code> to <code>x7</code> is the ability to open, read, and write to files.
We'll back the <code>x7</code> File implementation by the <code>rust</code> File struct, so let's make a new file in <code>x7</code> - <code>records/file.rs</code>:
</p>

<p>
We will start by making a <code>FileRecord</code> struct:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #9CC7FB;">#</span><span style="color: #DCDCCC;">[</span><span style="color: #9CC7FB;">derive</span><span style="color: #CCF8CC;">(</span><span style="color: #9CC7FB;">Clone, Debug</span><span style="color: #CCF8CC;">)</span><span style="color: #DCDCCC;">]</span>
<span style="color: #FDECBC; font-weight: bold;">pub</span><span style="color: #DCDCCC;">(</span><span style="color: #FDECBC; font-weight: bold;">crate</span><span style="color: #DCDCCC;">)</span> <span style="color: #FDECBC; font-weight: bold;">struct</span> <span style="color: #89C5C8;">FileRecord</span> <span style="color: #DCDCCC;">{</span>
    <span style="color: #ECBC9C;">path</span>: <span style="color: #89C5C8;">String</span>,
    <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">The Record trait requires Sync + Send</span>
    <span style="color: #ECBC9C;">file</span>: <span style="color: #89C5C8;">Arc</span><span style="color: #CCF8CC;">&lt;</span><span style="color: #89C5C8;">Mutex</span><span style="color: #DDCC9C;">&lt;</span><span style="color: #CCF8CC;">std</span>::<span style="color: #CCF8CC;">fs</span>::<span style="color: #89C5C8;">File</span><span style="color: #DDCC9C;">&gt;</span><span style="color: #CCF8CC;">&gt;</span>,
<span style="color: #DCDCCC;">}</span>
</pre>
</div>

<p>
The type <code>Arc&lt;Mutex&lt;std::fs::File&gt;&gt;</code> is necessary as <code>x7</code> requires all types to be thread safe.
</p>

<p>
Now that we have a struct, let's expose a way to generate one from <code>x7</code>. We want the following <code>x7</code> expression to work:
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #DCDCCC;">(</span>fs::open <span style="color: #D9A0A0;">"file-name"</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>

<p>
This will map to a <code>Expr::String("file-name")</code> in the interpreter, so we need two methods:
</p>

<ol class="org-ol">
<li>A way to open files given a <code>String</code></li>
<li>A way to open files given an <code>Expr::String</code></li>
</ol>

<p>
With that in mind, here's the two relevant methods:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #FDECBC; font-weight: bold;">impl</span> <span style="color: #89C5C8;">FileRecord</span> <span style="color: #DCDCCC;">{</span>
      <span style="color: #ACD2AC;">/// Open a file with the given Path</span>
      <span style="color: #FDECBC; font-weight: bold;">pub</span><span style="color: #CCF8CC;">(</span><span style="color: #FDECBC; font-weight: bold;">crate</span><span style="color: #CCF8CC;">)</span> <span style="color: #FDECBC; font-weight: bold;">fn</span> <span style="color: #A0EDF0;">open_file</span><span style="color: #CCF8CC;">(</span><span style="color: #ECBC9C;">path</span>: <span style="color: #89C5C8;">String</span><span style="color: #CCF8CC;">)</span> -&gt; <span style="color: #89C5C8;">LispResult</span><span style="color: #CCF8CC;">&lt;</span><span style="color: #89C5C8;">Expr</span><span style="color: #CCF8CC;">&gt;</span> <span style="color: #CCF8CC;">{</span>
      <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">Open the file with liberal permissions.</span>
      <span style="color: #FDECBC; font-weight: bold;">let</span> <span style="color: #ECBC9C;">f</span> = <span style="color: #89C5C8;">OpenOptions</span>::new<span style="color: #DDCC9C;">()</span>
          .write<span style="color: #DDCC9C;">(</span><span style="color: #FDECBC; font-weight: bold;">true</span><span style="color: #DDCC9C;">)</span>
          .create<span style="color: #DDCC9C;">(</span><span style="color: #FDECBC; font-weight: bold;">true</span><span style="color: #DDCC9C;">)</span>
          .read<span style="color: #DDCC9C;">(</span><span style="color: #FDECBC; font-weight: bold;">true</span><span style="color: #DDCC9C;">)</span>
          .open<span style="color: #DDCC9C;">(</span>path.clone<span style="color: #A0EDF0;">()</span><span style="color: #DDCC9C;">)</span>
          .map_err<span style="color: #DDCC9C;">(</span>|e| <span style="color: #9CC7FB;">anyhow!</span><span style="color: #A0EDF0;">(</span><span style="color: #D9A0A0;">"Could not open file \"{}\" because {}"</span>, &amp;path, e<span style="color: #A0EDF0;">)</span><span style="color: #DDCC9C;">)</span><span style="color: #DCDCCC; font-weight: bold;">?</span>;
      <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">Make the path pretty.</span>
      <span style="color: #FDECBC; font-weight: bold;">let</span> <span style="color: #ECBC9C;">abs_path</span> = <span style="color: #CCF8CC;">fs</span>::canonicalize<span style="color: #DDCC9C;">(</span>path<span style="color: #DDCC9C;">)</span>
          .map_err<span style="color: #DDCC9C;">(</span>|e| <span style="color: #9CC7FB;">anyhow!</span><span style="color: #A0EDF0;">(</span><span style="color: #D9A0A0;">"Could not canonicalize path! {}"</span>, e<span style="color: #A0EDF0;">)</span><span style="color: #DDCC9C;">)</span><span style="color: #DCDCCC; font-weight: bold;">?</span>
          .to_str<span style="color: #DDCC9C;">()</span>
          .ok_or_else<span style="color: #DDCC9C;">(</span>|| <span style="color: #9CC7FB;">anyhow!</span><span style="color: #A0EDF0;">(</span><span style="color: #D9A0A0;">"Could not represent path as UTF-8 string"</span><span style="color: #A0EDF0;">)</span><span style="color: #DDCC9C;">)</span><span style="color: #DCDCCC; font-weight: bold;">?</span>
          .into<span style="color: #DDCC9C;">()</span>;
      <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">record! is a macro to assist in making LispResult&lt;Expr::Record&gt; types</span>
      <span style="color: #9CC7FB;">record!</span><span style="color: #DDCC9C;">(</span><span style="color: #89C5C8;">FileRecord</span>::new<span style="color: #A0EDF0;">(</span>f, abs_path<span style="color: #A0EDF0;">)</span><span style="color: #DDCC9C;">)</span>
  <span style="color: #CCF8CC;">}</span>

  <span style="color: #ACD2AC;">/// Open a file from x7</span>
  <span style="color: #ACD2AC;">/// This function signature will let us expose it directly to the interpreter</span>
  <span style="color: #FDECBC; font-weight: bold;">pub</span><span style="color: #CCF8CC;">(</span><span style="color: #FDECBC; font-weight: bold;">crate</span><span style="color: #CCF8CC;">)</span> <span style="color: #FDECBC; font-weight: bold;">fn</span> <span style="color: #A0EDF0;">from_x7</span><span style="color: #CCF8CC;">(</span><span style="color: #ECBC9C;">exprs</span>: <span style="color: #89C5C8;">Vector</span><span style="color: #DDCC9C;">&lt;</span><span style="color: #89C5C8;">Expr</span><span style="color: #DDCC9C;">&gt;</span>, <span style="color: #ECBC9C;">_symbol_table</span>: &amp;<span style="color: #89C5C8;">SymbolTable</span><span style="color: #CCF8CC;">)</span> -&gt; <span style="color: #89C5C8;">LispResult</span><span style="color: #CCF8CC;">&lt;</span><span style="color: #89C5C8;">Expr</span><span style="color: #CCF8CC;">&gt;</span> <span style="color: #CCF8CC;">{</span>
      <span style="color: #9CC7FB;">exact_len!</span><span style="color: #DDCC9C;">(</span>exprs, <span style="color: #CCF8CC;">1</span><span style="color: #DDCC9C;">)</span>;
      <span style="color: #FDECBC; font-weight: bold;">let</span> <span style="color: #ECBC9C;">path</span> = exprs<span style="color: #DDCC9C;">[</span><span style="color: #CCF8CC;">0</span><span style="color: #DDCC9C;">]</span>.get_string<span style="color: #DDCC9C;">()</span><span style="color: #DCDCCC; font-weight: bold;">?</span>;
      <span style="color: #89C5C8;">FileRecord</span>::open_file<span style="color: #DDCC9C;">(</span>path<span style="color: #DDCC9C;">)</span>
  <span style="color: #CCF8CC;">}</span>
<span style="color: #DCDCCC;">}</span>
</pre>
</div>

<p>
Now that we have the ability to make a <code>FileRecord</code>, we'll need to implement <code>Record</code>
so it can be understood by the interpreter (<code>Expr::Record</code>).
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #FDECBC; font-weight: bold;">impl</span> <span style="color: #89C5C8;">Record</span> <span style="color: #FDECBC; font-weight: bold;">for</span> <span style="color: #89C5C8;">FileRecord</span> <span style="color: #DCDCCC;">{</span>
    <span style="color: #FDECBC; font-weight: bold;">fn</span> <span style="color: #A0EDF0;">call_method</span><span style="color: #CCF8CC;">(</span>&amp;<span style="color: #FDECBC; font-weight: bold;">self</span>, <span style="color: #ECBC9C;">sym</span>: &amp;<span style="color: #89C5C8;">str</span>, <span style="color: #ECBC9C;">args</span>: <span style="color: #89C5C8;">Vector</span><span style="color: #DDCC9C;">&lt;</span><span style="color: #89C5C8;">Expr</span><span style="color: #DDCC9C;">&gt;</span><span style="color: #CCF8CC;">)</span> -&gt; <span style="color: #89C5C8;">LispResult</span><span style="color: #CCF8CC;">&lt;</span><span style="color: #89C5C8;">Expr</span><span style="color: #CCF8CC;">&gt;</span> <span style="color: #CCF8CC;">{</span>
      <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">We have no methods yet.</span>
      <span style="color: #9CC7FB;">unknown_method!</span><span style="color: #DDCC9C;">(</span><span style="color: #FDECBC; font-weight: bold;">self</span>, sym<span style="color: #DDCC9C;">)</span>
    <span style="color: #CCF8CC;">}</span>

    <span style="color: #FDECBC; font-weight: bold;">fn</span> <span style="color: #A0EDF0;">type_name</span><span style="color: #CCF8CC;">(</span>&amp;<span style="color: #FDECBC; font-weight: bold;">self</span><span style="color: #CCF8CC;">)</span> -&gt; &amp;'<span style="color: #FDECBC; font-weight: bold;">static</span> <span style="color: #89C5C8;">str</span> <span style="color: #CCF8CC;">{</span>
        <span style="color: #D9A0A0;">"FileRecord"</span>
    <span style="color: #CCF8CC;">}</span>

    <span style="color: #FDECBC; font-weight: bold;">fn</span> <span style="color: #A0EDF0;">display</span><span style="color: #CCF8CC;">(</span>&amp;<span style="color: #FDECBC; font-weight: bold;">self</span><span style="color: #CCF8CC;">)</span> -&gt; <span style="color: #89C5C8;">String</span> <span style="color: #CCF8CC;">{</span>
        <span style="color: #DCDCCC; font-weight: bold;">format!</span><span style="color: #DDCC9C;">(</span><span style="color: #D9A0A0;">"File&lt;</span><span style="color: #D9A0A0; font-style: italic;">{}</span><span style="color: #D9A0A0;">&gt;"</span>, <span style="color: #FDECBC; font-weight: bold;">self</span>.path<span style="color: #DDCC9C;">)</span>
    <span style="color: #CCF8CC;">}</span>

    <span style="color: #FDECBC; font-weight: bold;">fn</span> <span style="color: #A0EDF0;">debug</span><span style="color: #CCF8CC;">(</span>&amp;<span style="color: #FDECBC; font-weight: bold;">self</span><span style="color: #CCF8CC;">)</span> -&gt; <span style="color: #89C5C8;">String</span> <span style="color: #CCF8CC;">{</span>
        <span style="color: #FDECBC; font-weight: bold;">self</span>.display<span style="color: #DDCC9C;">()</span>
    <span style="color: #CCF8CC;">}</span>

    <span style="color: #FDECBC; font-weight: bold;">fn</span> <span style="color: #A0EDF0;">clone</span><span style="color: #CCF8CC;">(</span>&amp;<span style="color: #FDECBC; font-weight: bold;">self</span><span style="color: #CCF8CC;">)</span> -&gt; <span style="color: #89C5C8;">RecordType</span> <span style="color: #CCF8CC;">{</span>
        <span style="color: #89C5C8;">Box</span>::new<span style="color: #DDCC9C;">(</span><span style="color: #89C5C8;">Clone</span>::clone<span style="color: #A0EDF0;">(</span><span style="color: #FDECBC; font-weight: bold;">self</span><span style="color: #A0EDF0;">)</span><span style="color: #DDCC9C;">)</span>
    <span style="color: #CCF8CC;">}</span>

    <span style="color: #FDECBC; font-weight: bold;">fn</span> <span style="color: #A0EDF0;">methods</span><span style="color: #CCF8CC;">(</span>&amp;<span style="color: #FDECBC; font-weight: bold;">self</span><span style="color: #CCF8CC;">)</span> -&gt; <span style="color: #89C5C8;">Vec</span><span style="color: #CCF8CC;">&lt;</span>&amp;'<span style="color: #FDECBC; font-weight: bold;">static</span> <span style="color: #89C5C8;">str</span><span style="color: #CCF8CC;">&gt;</span> <span style="color: #CCF8CC;">{</span>
        <span style="color: #89C5C8;">Vec</span>::new<span style="color: #DDCC9C;">()</span>
    <span style="color: #CCF8CC;">}</span>

    <span style="color: #FDECBC; font-weight: bold;">fn</span> <span style="color: #A0EDF0;">id</span><span style="color: #CCF8CC;">(</span>&amp;<span style="color: #FDECBC; font-weight: bold;">self</span><span style="color: #CCF8CC;">)</span> -&gt; <span style="color: #89C5C8;">u64</span> <span style="color: #CCF8CC;">{</span>
        <span style="color: #FDECBC; font-weight: bold;">use</span> <span style="color: #CCF8CC;">std</span>::<span style="color: #CCF8CC;">collections</span>::<span style="color: #CCF8CC;">hash_map</span>::<span style="color: #89C5C8;">DefaultHasher</span>;
        <span style="color: #FDECBC; font-weight: bold;">use</span> <span style="color: #CCF8CC;">std</span>::<span style="color: #CCF8CC;">hash</span>::<span style="color: #DDCC9C;">{</span><span style="color: #89C5C8;">Hash</span>, <span style="color: #89C5C8;">Hasher</span><span style="color: #DDCC9C;">}</span>;
        <span style="color: #FDECBC; font-weight: bold;">let</span> <span style="color: #FDECBC; font-weight: bold;">mut</span> <span style="color: #ECBC9C;">h</span> = <span style="color: #89C5C8;">DefaultHasher</span>::new<span style="color: #DDCC9C;">()</span>;
        <span style="color: #FDECBC; font-weight: bold;">self</span>.path.hash<span style="color: #DDCC9C;">(</span>&amp;<span style="color: #FDECBC; font-weight: bold;">mut</span> h<span style="color: #DDCC9C;">)</span>;
        h.finish<span style="color: #DDCC9C;">()</span>
    <span style="color: #CCF8CC;">}</span>
<span style="color: #DCDCCC;">}</span>
</pre>
</div>

<p>
We also need to expose <code>FileRecord::from_x7</code> to the interpreter, so let's head back and add it to <code>make_stdlib_fns</code>:
</p>

<div class="org-src-container">
<pre class="src src-rust"> <span style="color: #9CC7FB;">make_stdlib_fns!</span><span style="color: #DCDCCC;">{</span>
  <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">elided functions...</span>
  <span style="color: #CCF8CC;">(</span><span style="color: #D9A0A0;">"call_method"</span>, <span style="color: #CCF8CC;">2</span>, call_method, <span style="color: #FDECBC; font-weight: bold;">true</span>, <span style="color: #D9A0A0;">"&lt;doc-string&gt;"</span><span style="color: #CCF8CC;">)</span>,
  <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">Open a file</span>
  <span style="color: #CCF8CC;">(</span><span style="color: #D9A0A0;">"fs::open"</span>, <span style="color: #CCF8CC;">1</span>, <span style="color: #89C5C8;">FileRecord</span>::from_x7, <span style="color: #FDECBC; font-weight: bold;">true</span>, <span style="color: #D9A0A0;">"Open a file."</span><span style="color: #CCF8CC;">)</span>,
<span style="color: #DCDCCC;">}</span>
</pre>
</div>

<p>
We can now compile and run <code>x7</code> to see what happens:
</p>

<div class="org-src-container">
<pre class="src src-lisp">&gt;&gt;&gt; <span style="color: #DCDCCC;">(</span>def f <span style="color: #CCF8CC;">(</span>fs::open <span style="color: #D9A0A0;">"hello-world.txt"</span><span style="color: #CCF8CC;">)</span><span style="color: #DCDCCC;">)</span>
nil
&gt;&gt;&gt; f
File&lt;/home/david/programming/x7/hello-world.txt&gt;
</pre>
</div>

<p>
Nice! We've opened a file. We can now implement some other useful methods on <code>FileRecord</code> like reading from a file:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #FDECBC; font-weight: bold;">impl</span> <span style="color: #89C5C8;">FileRecord</span> <span style="color: #DCDCCC;">{</span>
  <span style="color: #ACD2AC;">/// Read the contents of a file to a String,</span>
  <span style="color: #ACD2AC;">/// rewinding the cursor to the front.</span>
  <span style="color: #FDECBC; font-weight: bold;">fn</span> <span style="color: #A0EDF0;">read_all</span><span style="color: #CCF8CC;">(</span>&amp;<span style="color: #FDECBC; font-weight: bold;">self</span><span style="color: #CCF8CC;">)</span> -&gt; <span style="color: #89C5C8;">LispResult</span><span style="color: #CCF8CC;">&lt;</span><span style="color: #89C5C8;">String</span><span style="color: #CCF8CC;">&gt;</span> <span style="color: #CCF8CC;">{</span>
      <span style="color: #FDECBC; font-weight: bold;">let</span> <span style="color: #FDECBC; font-weight: bold;">mut</span> <span style="color: #ECBC9C;">buf</span> = <span style="color: #89C5C8;">String</span>::new<span style="color: #DDCC9C;">()</span>;
      <span style="color: #FDECBC; font-weight: bold;">let</span> <span style="color: #FDECBC; font-weight: bold;">mut</span> <span style="color: #ECBC9C;">guard</span> = <span style="color: #FDECBC; font-weight: bold;">self</span>.file.lock<span style="color: #DDCC9C;">()</span>;
      guard
          .read_to_string<span style="color: #DDCC9C;">(</span>&amp;<span style="color: #FDECBC; font-weight: bold;">mut</span> buf<span style="color: #DDCC9C;">)</span>
          .map_err<span style="color: #DDCC9C;">(</span>|e| <span style="color: #9CC7FB;">anyhow!</span><span style="color: #A0EDF0;">(</span><span style="color: #D9A0A0;">"Failed to read to string {}"</span>, e<span style="color: #A0EDF0;">)</span><span style="color: #DDCC9C;">)</span><span style="color: #DCDCCC; font-weight: bold;">?</span>;
      <span style="color: #9CC7FB;">rewind_file!</span><span style="color: #DDCC9C;">(</span>guard<span style="color: #DDCC9C;">)</span>;
      <span style="color: #89C5C8;">Ok</span><span style="color: #DDCC9C;">(</span>buf<span style="color: #DDCC9C;">)</span>
  <span style="color: #CCF8CC;">}</span>

  <span style="color: #ACD2AC;">/// Read the contents of a FileRecord to a string.</span>
  <span style="color: #FDECBC; font-weight: bold;">fn</span> <span style="color: #A0EDF0;">read_to_string</span><span style="color: #CCF8CC;">(</span>&amp;<span style="color: #FDECBC; font-weight: bold;">self</span>, <span style="color: #ECBC9C;">args</span>: <span style="color: #89C5C8;">Vector</span><span style="color: #DDCC9C;">&lt;</span><span style="color: #89C5C8;">Expr</span><span style="color: #DDCC9C;">&gt;</span><span style="color: #CCF8CC;">)</span> -&gt; <span style="color: #89C5C8;">LispResult</span><span style="color: #CCF8CC;">&lt;</span><span style="color: #89C5C8;">Expr</span><span style="color: #CCF8CC;">&gt;</span> <span style="color: #CCF8CC;">{</span>
      <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">We want no arguments.</span>
      <span style="color: #9CC7FB;">exact_len!</span><span style="color: #DDCC9C;">(</span>args, <span style="color: #CCF8CC;">0</span><span style="color: #DDCC9C;">)</span>;
      <span style="color: #FDECBC; font-weight: bold;">self</span>.read_all<span style="color: #DDCC9C;">()</span>.map<span style="color: #DDCC9C;">(</span><span style="color: #89C5C8;">Expr</span>::<span style="color: #89C5C8;">String</span><span style="color: #DDCC9C;">)</span>
  <span style="color: #CCF8CC;">}</span>
<span style="color: #DCDCCC;">}</span>
</pre>
</div>

<p>
We can update our <code>Record</code> implementation for <code>FileRecord</code> to include this method:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #FDECBC; font-weight: bold;">impl</span> <span style="color: #89C5C8;">Record</span> <span style="color: #FDECBC; font-weight: bold;">for</span> <span style="color: #89C5C8;">FileRecord</span> <span style="color: #DCDCCC;">{</span>
    <span style="color: #FDECBC; font-weight: bold;">fn</span> <span style="color: #A0EDF0;">call_method</span><span style="color: #CCF8CC;">(</span>&amp;<span style="color: #FDECBC; font-weight: bold;">self</span>, <span style="color: #ECBC9C;">sym</span>: &amp;<span style="color: #89C5C8;">str</span>, <span style="color: #ECBC9C;">args</span>: <span style="color: #89C5C8;">Vector</span><span style="color: #DDCC9C;">&lt;</span><span style="color: #89C5C8;">Expr</span><span style="color: #DDCC9C;">&gt;</span><span style="color: #CCF8CC;">)</span> -&gt; <span style="color: #89C5C8;">LispResult</span><span style="color: #CCF8CC;">&lt;</span><span style="color: #89C5C8;">Expr</span><span style="color: #CCF8CC;">&gt;</span> <span style="color: #CCF8CC;">{</span>
        <span style="color: #FDECBC; font-weight: bold;">match</span> sym <span style="color: #DDCC9C;">{</span>
            <span style="color: #D9A0A0;">"read_to_string"</span> =&gt; <span style="color: #FDECBC; font-weight: bold;">self</span>.read_to_string<span style="color: #A0EDF0;">(</span>args<span style="color: #A0EDF0;">)</span>,
            _ =&gt; <span style="color: #9CC7FB;">unknown_method!</span><span style="color: #A0EDF0;">(</span><span style="color: #FDECBC; font-weight: bold;">self</span>, sym<span style="color: #A0EDF0;">)</span>,
        <span style="color: #DDCC9C;">}</span>
    <span style="color: #CCF8CC;">}</span>
<span style="color: #DCDCCC;">}</span>
</pre>
</div>

<p>
And use it:
</p>

<div class="org-src-container">
<pre class="src src-lisp">~ echo <span style="color: #D9A0A0;">"hello"</span> &gt; hello-world.txt
~ x7
&gt;&gt;&gt; <span style="color: #DCDCCC;">(</span>def f <span style="color: #CCF8CC;">(</span>fs::open <span style="color: #D9A0A0;">"hello-world.txt"</span><span style="color: #CCF8CC;">)</span><span style="color: #DCDCCC;">)</span>
&gt;&gt;&gt; <span style="color: #DCDCCC;">(</span>call_method f <span style="color: #D9A0A0;">"read_to_string"</span><span style="color: #DCDCCC;">)</span>
<span style="color: #D9A0A0;">"hello"</span>
</pre>
</div>

<p>
Awesome! We're able to call methods on <code>FileRecord</code>. It's the same process to implement <code>.write</code> and other useful file operations, so we'll elide it. This is great stuff, and would be even better with some syntactic sugar.
</p>

<p>
Let's add method call syntax so these two expressions are equal:
</p>

<div class="org-src-container">
<pre class="src src-lisp">&gt;&gt;&gt; <span style="color: #DCDCCC;">(</span>call_method f <span style="color: #D9A0A0;">"read_to_string"</span><span style="color: #DCDCCC;">)</span>
&gt;&gt;&gt; <span style="color: #DCDCCC;">(</span>.read_to_string f<span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
</div>
