blog/2020-09-02/Implementing-Method-Calls-In-x7.org
** Adding Method call syntax in x7

Without getting too much in the parser weeds, =.method= is parsed into an =Expr::Symbol=.
We can modify the parser to recognize the period, and instead parse it into a =Function= that calls our method for us.

The =parse_symbol= function is defined as:

#+begin_src rust
fn parse_symbol<'a>(i: &'a str) -> IResult<&'a str, Expr, VerboseError<&'a str>> {
    map(take_while1(is_symbol_char), |sym: &str| {
        Expr::Symbol(sym.into())
    })(i)
}
#+end_src

So all it does is try to recognize a symbol, and then transform the type when it fully parses one. We'll modify it to recognize if a symbol starts with a period, and if so, call =make_method_call= and return an =Expr::Function=.

Let's first make =make_method_call=:
((if (random_bool) + -) 10 5)
#+begin_src rust
  fn make_method_call(method: String) -> Expr {
      // Import some useful types
      use crate::symbols::Function;
      use std::sync::Arc;
      let method_clone = method.clone();
      // This is the cool part. We're making a closure that obeys
      // the X7FunctionPtr type.
      // When we call .write, it'll call this function.
      let method_fn = move |args: Vector<Expr>, _sym: &SymbolTable| {
          // First item is a record, and get it
          let rec = match args[0].get_record() {
              Ok(rec) => rec,
              Err(e) => return Err(e),
          };
          // `rec` is a record, so call the method.
          // Note that we move `method_clone` into this this closure!
          use crate::records::Record;
          // The layout of `args` is: (<record> <arg1> <arg2> ...),
          // and the type signature we have is Record::call_method(method, args)
          rec.call_method(&method_clone, args.clone().slice(1..));
      };
      // Make a Function struct
      let f = Function::new(
          format!("method_call<{}>", method), // function name
          1,                                  // number of args
          Arc::new(method_fn),                // function pointer
          true,                               // eval args
      );
      // Return an Expr::Function
      Expr::Function(f)
  }
#+end_src

This is pretty cool - we're transforming a symbol into a function. All we need to do
is to add an if-gate into =parse_symbol=, and we're set!

#+begin_src rust
  fn parse_symbol<'a>(i: &'a str) -> IResult<&'a str, Expr, VerboseError<&'a str>> {
      map(take_while1(is_symbol_char), |sym: &str| {
          if sym.starts_with('.') {
              make_method_call(sym[1..].into()) // sym[1..] => drop the period
          } else {
              Expr::Symbol(sym.into())
          }
      })(i)
  }
#+end_src

We can start =x7= and test it out:

#+begin_src lisp
>>> .read_to_string
Fn<method_call<read_to_string>, 1, [ ]>
#+end_src

Nice, we're getting a function from our parser. We can try using it:


#+begin_src rust
>>> (def f (fs::open "hello-world.txt"))
>>> (.read_to_string f)
"hello"
#+end_src

And that's it! We've implemented records in =x7=. I hope you enjoyed reading the article!
