blog/2020-09-02/Implementing-Method-Calls-In-x7.html

<div id="outline-container-org2499492" class="outline-3">
<h3 id="org2499492">Adding Method call syntax in x7</h3>
<div class="outline-text-3" id="text-org2499492">
<p>
Without getting too much in the parser weeds, <code>.method</code> is parsed into an <code>Expr::Symbol</code>.
We can modify the parser to recognize the period, and instead parse it into a <code>Function</code> that calls our method for us.
</p>

<p>
The <code>parse_symbol</code> function is defined as:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #FDECBC; font-weight: bold;">fn</span> <span style="color: #A0EDF0;">parse_symbol</span><span style="color: #DCDCCC;">&lt;</span>'<span style="color: #ECBC9C;">a</span><span style="color: #DCDCCC;">&gt;(</span><span style="color: #ECBC9C;">i</span>: &amp;'<span style="color: #ECBC9C;">a</span> <span style="color: #89C5C8;">str</span><span style="color: #DCDCCC;">)</span> -&gt; <span style="color: #89C5C8;">IResult</span><span style="color: #DCDCCC;">&lt;</span>&amp;'<span style="color: #ECBC9C;">a</span> <span style="color: #89C5C8;">str</span>, <span style="color: #89C5C8;">Expr</span>, <span style="color: #89C5C8;">VerboseError</span><span style="color: #CCF8CC;">&lt;</span>&amp;'<span style="color: #ECBC9C;">a</span> <span style="color: #89C5C8;">str</span><span style="color: #CCF8CC;">&gt;</span><span style="color: #DCDCCC;">&gt;</span> <span style="color: #DCDCCC;">{</span>
    map<span style="color: #CCF8CC;">(</span>take_while1<span style="color: #DDCC9C;">(</span>is_symbol_char<span style="color: #DDCC9C;">)</span>, |<span style="color: #ECBC9C;">sym</span>: &amp;<span style="color: #89C5C8;">str</span>| <span style="color: #DDCC9C;">{</span>
        <span style="color: #89C5C8;">Expr</span>::<span style="color: #89C5C8;">Symbol</span><span style="color: #A0EDF0;">(</span>sym.into<span style="color: #ACD2AC;">()</span><span style="color: #A0EDF0;">)</span>
    <span style="color: #DDCC9C;">}</span><span style="color: #CCF8CC;">)(</span>i<span style="color: #CCF8CC;">)</span>
<span style="color: #DCDCCC;">}</span>
</pre>
</div>

<p>
So all it does is try to recognize a symbol, and then transform the type when it fully parses one. We'll modify it to recognize if a symbol starts with a period, and if so, call <code>make_method_call</code> and return an <code>Expr::Function</code>.
</p>

<p>
Let's first make <code>make_method_call</code>:
((if (random_bool) + -) 10 5)
</p>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #FDECBC; font-weight: bold;">fn</span> <span style="color: #A0EDF0;">make_method_call</span><span style="color: #DCDCCC;">(</span><span style="color: #ECBC9C;">method</span>: <span style="color: #89C5C8;">String</span><span style="color: #DCDCCC;">)</span> -&gt; <span style="color: #89C5C8;">Expr</span> <span style="color: #DCDCCC;">{</span>
    <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">Import some useful types</span>
    <span style="color: #FDECBC; font-weight: bold;">use</span> <span style="color: #FDECBC; font-weight: bold;">crate</span>::<span style="color: #CCF8CC;">symbols</span>::<span style="color: #89C5C8;">Function</span>;
    <span style="color: #FDECBC; font-weight: bold;">use</span> <span style="color: #CCF8CC;">std</span>::<span style="color: #CCF8CC;">sync</span>::<span style="color: #89C5C8;">Arc</span>;
    <span style="color: #FDECBC; font-weight: bold;">let</span> <span style="color: #ECBC9C;">method_clone</span> = method.clone<span style="color: #CCF8CC;">()</span>;
    <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">This is the cool part. We're making a closure that obeys</span>
    <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">the X7FunctionPtr type.</span>
    <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">When we call .write, it'll call this function.</span>
    <span style="color: #FDECBC; font-weight: bold;">let</span> <span style="color: #ECBC9C;">method_fn</span> = <span style="color: #FDECBC; font-weight: bold;">move</span> |<span style="color: #ECBC9C;">args</span>: <span style="color: #89C5C8;">Vector</span><span style="color: #CCF8CC;">&lt;</span><span style="color: #89C5C8;">Expr</span><span style="color: #CCF8CC;">&gt;</span>, <span style="color: #ECBC9C;">_sym</span>: &amp;<span style="color: #89C5C8;">SymbolTable</span>| <span style="color: #CCF8CC;">{</span>
        <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">First item is a record, and get it</span>
        <span style="color: #FDECBC; font-weight: bold;">let</span> <span style="color: #ECBC9C;">rec</span> = <span style="color: #FDECBC; font-weight: bold;">match</span> args<span style="color: #DDCC9C;">[</span><span style="color: #CCF8CC;">0</span><span style="color: #DDCC9C;">]</span>.get_record<span style="color: #DDCC9C;">()</span> <span style="color: #DDCC9C;">{</span>
            <span style="color: #89C5C8;">Ok</span><span style="color: #A0EDF0;">(</span>rec<span style="color: #A0EDF0;">)</span> =&gt; rec,
            <span style="color: #89C5C8;">Err</span><span style="color: #A0EDF0;">(</span>e<span style="color: #A0EDF0;">)</span> =&gt; <span style="color: #FDECBC; font-weight: bold;">return</span> <span style="color: #89C5C8;">Err</span><span style="color: #A0EDF0;">(</span>e<span style="color: #A0EDF0;">)</span>,
        <span style="color: #DDCC9C;">}</span>;
        <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">`rec` is a record, so call the method.</span>
        <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">Note that we move `method_clone` into this this closure!</span>
        <span style="color: #FDECBC; font-weight: bold;">use</span> <span style="color: #FDECBC; font-weight: bold;">crate</span>::<span style="color: #CCF8CC;">records</span>::<span style="color: #89C5C8;">Record</span>;
        <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">The layout of `args` is: (&lt;record&gt; &lt;arg1&gt; &lt;arg2&gt; ...),</span>
        <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">and the type signature we have is Record::call_method(method, args)</span>
        rec.call_method<span style="color: #DDCC9C;">(</span>&amp;method_clone, args.clone<span style="color: #A0EDF0;">()</span>.slice<span style="color: #A0EDF0;">(</span><span style="color: #CCF8CC;">1</span>..<span style="color: #A0EDF0;">)</span><span style="color: #DDCC9C;">)</span>;
    <span style="color: #CCF8CC;">}</span>;
    <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">Make a Function struct</span>
    <span style="color: #FDECBC; font-weight: bold;">let</span> <span style="color: #ECBC9C;">f</span> = <span style="color: #89C5C8;">Function</span>::new<span style="color: #CCF8CC;">(</span>
        <span style="color: #DCDCCC; font-weight: bold;">format!</span><span style="color: #DDCC9C;">(</span><span style="color: #D9A0A0;">"method_call&lt;</span><span style="color: #D9A0A0; font-style: italic;">{}</span><span style="color: #D9A0A0;">&gt;"</span>, method<span style="color: #DDCC9C;">)</span>, <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">function name</span>
        <span style="color: #CCF8CC;">1</span>,                                  <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">number of args</span>
        <span style="color: #89C5C8;">Arc</span>::new<span style="color: #DDCC9C;">(</span>method_fn<span style="color: #DDCC9C;">)</span>,                <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">function pointer</span>
        <span style="color: #FDECBC; font-weight: bold;">true</span>,                               <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">eval args</span>
    <span style="color: #CCF8CC;">)</span>;
    <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">Return an Expr::Function</span>
    <span style="color: #89C5C8;">Expr</span>::<span style="color: #89C5C8;">Function</span><span style="color: #CCF8CC;">(</span>f<span style="color: #CCF8CC;">)</span>
<span style="color: #DCDCCC;">}</span>
</pre>
</div>

<p>
This is pretty cool - we're transforming a symbol into a function. All we need to do
is to add an if-gate into <code>parse_symbol</code>, and we're set!
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #FDECBC; font-weight: bold;">fn</span> <span style="color: #A0EDF0;">parse_symbol</span><span style="color: #DCDCCC;">&lt;</span>'<span style="color: #ECBC9C;">a</span><span style="color: #DCDCCC;">&gt;(</span><span style="color: #ECBC9C;">i</span>: &amp;'<span style="color: #ECBC9C;">a</span> <span style="color: #89C5C8;">str</span><span style="color: #DCDCCC;">)</span> -&gt; <span style="color: #89C5C8;">IResult</span><span style="color: #DCDCCC;">&lt;</span>&amp;'<span style="color: #ECBC9C;">a</span> <span style="color: #89C5C8;">str</span>, <span style="color: #89C5C8;">Expr</span>, <span style="color: #89C5C8;">VerboseError</span><span style="color: #CCF8CC;">&lt;</span>&amp;'<span style="color: #ECBC9C;">a</span> <span style="color: #89C5C8;">str</span><span style="color: #CCF8CC;">&gt;</span><span style="color: #DCDCCC;">&gt;</span> <span style="color: #DCDCCC;">{</span>
    map<span style="color: #CCF8CC;">(</span>take_while1<span style="color: #DDCC9C;">(</span>is_symbol_char<span style="color: #DDCC9C;">)</span>, |<span style="color: #ECBC9C;">sym</span>: &amp;<span style="color: #89C5C8;">str</span>| <span style="color: #DDCC9C;">{</span>
        <span style="color: #FDECBC; font-weight: bold;">if</span> sym.starts_with<span style="color: #A0EDF0;">(</span><span style="color: #D9A0A0;">'.'</span><span style="color: #A0EDF0;">)</span> <span style="color: #A0EDF0;">{</span>
            make_method_call<span style="color: #ACD2AC;">(</span>sym<span style="color: #9CC7FB;">[</span><span style="color: #CCF8CC;">1</span>..<span style="color: #9CC7FB;">]</span>.into<span style="color: #9CC7FB;">()</span><span style="color: #ACD2AC;">)</span> <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">sym[1..] =&gt; drop the period</span>
        <span style="color: #A0EDF0;">}</span> <span style="color: #FDECBC; font-weight: bold;">else</span> <span style="color: #A0EDF0;">{</span>
            <span style="color: #89C5C8;">Expr</span>::<span style="color: #89C5C8;">Symbol</span><span style="color: #ACD2AC;">(</span>sym.into<span style="color: #9CC7FB;">()</span><span style="color: #ACD2AC;">)</span>
        <span style="color: #A0EDF0;">}</span>
    <span style="color: #DDCC9C;">}</span><span style="color: #CCF8CC;">)(</span>i<span style="color: #CCF8CC;">)</span>
<span style="color: #DCDCCC;">}</span>
</pre>
</div>

<p>
We can start <code>x7</code> and test it out:
</p>

<div class="org-src-container">
<pre class="src src-lisp">&gt;&gt;&gt; .read_to_string
Fn&lt;method_call&lt;read_to_string&gt;, <span style="color: #CCF8CC;">1</span>, [ ]&gt;
</pre>
</div>

<p>
Nice, we're getting a function from our parser. We can try using it:
</p>


<div class="org-src-container">
<pre class="src src-rust">&gt;&gt;&gt; <span style="color: #DCDCCC;">(</span>def f <span style="color: #CCF8CC;">(</span><span style="color: #CCF8CC;">fs</span>::open <span style="color: #D9A0A0;">"hello-world.txt"</span><span style="color: #CCF8CC;">)</span><span style="color: #DCDCCC;">)</span>
&gt;&gt;&gt; <span style="color: #DCDCCC;">(</span>.read_to_string f<span style="color: #DCDCCC;">)</span>
<span style="color: #D9A0A0;">"hello"</span>
</pre>
</div>

<p>
And that's it! We've implemented records in <code>x7</code>. I hope you enjoyed reading the article!
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: David Briggs</p>
<p class="date">Created: 2020-09-12 Sat 18:45</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
